%Градиент поля
global fieldGrad;
fieldGrad = [1, 1, 1] / sqrt(3);
%Задание начальных условия
r1 = [0; 0; 0];
r2 = [0; 4; 0];
r3 = [2; 3; 0];
tFinish = 0.5; 

%Преобразование в вектор состания
X0 = zeros(9, 1);
X0(1:3) = r1;
X0(4:6) = r2;
X0(7:9) = r3;

%Моделирование
opts = odeset('RelTol', 1e-12);
[t, X] = ode15s(@(t, X)calcV(X), [0, tFinish], X0, opts);

%Изменение угла между градиентом поля и нормалью к треугольнику
ang = zeros(size(X, 1), 1);
for k = 1: size(X, 1)
    r1 = X(k, 1:3);
    r2 = X(k, 4:6);
    r3 = X(k, 7:9);
    normal = getNorm(r1, r2, r3);
    ang(k) = acos(dot(normal, fieldGrad))/pi*180;
end
plot(t, ang, 'backcolor', 'yellow');
figure;

% %Графики для робота 1
% plot(X(:, 1), X(:, 2));
% title('Проекция траектории первого робота на плоскость Oxy');
% figure;
% plot(X(:, 2), X(:, 3));
% title('Проекция траектории первого робота на плоскость Oyz');
% figure;
% plot(X(:, 1), X(:, 3));
% title('Проекция траектории первого робота на плоскость Oxz');
% figure;
% 
% %Графики для робота 2
% plot(X(:, 4), X(:, 5));
% title('Проекция траектории второго робота на плоскость Oxy');
% figure;
% plot(X(:, 5), X(:, 6));
% title('Проекция траектории второго робота на плоскость Oyz');
% figure;
% plot(X(:, 4), X(:, 6));
% title('Проекция траектории второго робота на плоскость Oxz');
% figure;
% 
% %Графики для робота 3
% plot(X(:, 7), X(:, 8));
% title('Проекция траектории третьего робота на плоскость Oxy');
% figure;
% plot(X(:, 8), X(:, 9));
% title('Проекция траектории третьего робота на плоскость Oyz');
% figure;
% plot(X(:, 7), X(:, 9));
% title('Проекция траектории третьего робота на плоскость Oxz');

%Графики для робота 1
plot(t, X(:, 1));
figure;
plot(t, X(:, 2));
figure;
plot(t, X(:, 3));
figure;

%Графики для робота 2
plot(t, X(:, 4));
figure;
plot(t, X(:, 5));
figure;
plot(t, X(:, 6));
figure;

%Графики для робота 3
plot(t, X(:, 7));
figure;
plot(t, X(:, 8));
figure;
plot(t, X(:, 9));

VX = zeros(size(X, 1), 9);
for k = 1: size(X, 1)
    VX(k, :) = calcV(X(k, :));
end

%Графики для робота 1
plot(t, VX(:, 1));
figure;
plot(t, VX(:, 2));
figure;
plot(t, VX(:, 3));
figure;

%Графики для робота 2
plot(t, VX(:, 4));
figure;
plot(t, VX(:, 5));
figure;
plot(t, VX(:, 6));
figure;

%Графики для робота 3
plot(t, VX(:, 7));
figure;
plot(t, VX(:, 8));
figure;
plot(t, VX(:, 9));
% %Графики скорости для робота 1
% plot(VX(:, 1), VX(:, 2));
% title('Проекция траектории первого робота на плоскость Oxy');
% figure;
% plot(VX(:, 2), VX(:, 3));
% title('Проекция траектории первого робота на плоскость Oyz');
% figure;
% plot(VX(:, 1), VX(:, 3));
% title('Проекция траектории первого робота на плоскость Oxz');
% figure;
% 
% %Графики скорости для робота 2
% plot(VX(:, 4), VX(:, 5));
% title('Проекция траектории второго робота на плоскость Oxy');
% figure;
% plot(VX(:, 5), VX(:, 6));
% title('Проекция траектории второго робота на плоскость Oyz');
% figure;
% plot(VX(:, 4), VX(:, 6));
% title('Проекция траектории второго робота на плоскость Oxz');
% figure;
% 
% %Графики скорости для робота 3
% plot(VX(:, 7), VX(:, 8));
% title('Проекция траектории третьего робота на плоскость Oxy');
% figure;
% plot(VX(:, 8), VX(:, 9));
% title('Проекция траектории третьего робота на плоскость Oyz');
% figure;
% plot(VX(:, 7), VX(:, 9));
% title('Проекция траектории третьего робота на плоскость Oxz');